[
    {
        "Title": "Fantastic Beasts: The Secrets of Dumbledore",
        "Overview": "Professor Albus Dumbledore knows the powerful, dark wizard Gellert Grindelwald is moving to seize control of the wizarding world. Unable to stop him alone, he entrusts magizoologist Newt Scamander to lead an intrepid team of wizards and witches. They soon encounter an array of old and new beasts as they clash with Grindelwald's growing legion of followers.",
        "Release Year": "2022",
        "Runtime(Mins)": 142,
        "Average Vote": 6.7,
        "Popularity": 96.461,
        "Genres": "Fantasy",
        "Cast": "Eddie Redmayne, Jude Law, Mads Mikkelsen, Ezra Miller, Dan Fogler",
        "Director": "David Yates"
    },
    {
        "Title": "Dumb Money",
        "Overview": "Vlogger Keith Gill sinks his life savings into GameStop stock and posts about it. When social media starts blowing up, so do his life and the lives of everyone following him. As a stock tip becomes a movement, everyone gets rich—until the billionaires fight back, and both sides find their worlds turned upside down.",
        "Release Year": "2023",
        "Runtime(Mins)": 104,
        "Average Vote": 6.731,
        "Popularity": 35.56,
        "Genres": "Drama",
        "Cast": "Paul Dano, Shailene Woodley, America Ferrera, Pete Davidson, Seth Rogen",
        "Director": "Craig Gillespie"
    },
    {
        "Title": "Windfall",
        "Overview": "A man breaks into a tech billionaire's empty vacation home, but things go sideways when the arrogant mogul and his wife arrive for a last-minute getaway.",
        "Release Year": "2022",
        "Runtime(Mins)": 93,
        "Average Vote": 5.4,
        "Popularity": 17.285,
        "Genres": "Thriller",
        "Cast": "Jason Segel, Lily Collins, Jesse Plemons, Omar Leyva",
        "Director": "Charlie McDowell"
    },
    {
        "Title": "Delhi Belly",
        "Overview": "Three unsuspecting, average guys find themselves on the hit list of one of India's most-powerful crime syndicates.",
        "Release Year": "2011",
        "Runtime(Mins)": 102,
        "Average Vote": 7.038,
        "Popularity": 7.573,
        "Genres": "Action",
        "Cast": "Imran Khan, Kunaal Roy Kapur, Vir Das, Shenaz Treasury, Poorna Jagannathan",
        "Director": "Abhinay Deo"
    },
    {
        "Title": "Dual",
        "Overview": "A terminally ill woman opts for a cloning procedure to ease her loss on her friends and family. When she makes a miraculous recovery, her attempts to have her clone decommissioned fail and lead to a court-mandated duel to the death.",
        "Release Year": "2022",
        "Runtime(Mins)": 95,
        "Average Vote": 5.975,
        "Popularity": 15.294,
        "Genres": "Science Fiction",
        "Cast": "Karen Gillan, Aaron Paul, Beulah Koale, Theo James, Elina Jackson",
        "Director": "Riley Stearns"
    },
    {
        "Title": "The Equalizer 3",
        "Overview": "Robert McCall finds himself at home in Southern Italy but he discovers his friends are under the control of local crime bosses. As events turn deadly, McCall knows what he has to do: become his friends' protector by taking on the mafia.",
        "Release Year": "2023",
        "Runtime(Mins)": 109,
        "Average Vote": 7.4,
        "Popularity": 210.926,
        "Genres": "Action",
        "Cast": "Denzel Washington, Dakota Fanning, Eugenio Mastrandrea, David Denman, Gaia Scodellaro",
        "Director": "Antoine Fuqua"
    },
    {
        "Title": "American Made",
        "Overview": "The true story of pilot Barry Seal, who transported contraband for the CIA and the Medellin cartel in the 1980s.",
        "Release Year": "2017",
        "Runtime(Mins)": 115,
        "Average Vote": 6.876,
        "Popularity": 27.357,
        "Genres": "Comedy",
        "Cast": "Tom Cruise, Sarah Wright, Domhnall Gleeson, Alejandro Edda, Jesse Plemons",
        "Director": "Doug Liman"
    },
    {
        "Title": "Gran Turismo",
        "Overview": "The ultimate wish-fulfillment tale of a teenage Gran Turismo player whose gaming skills won him a series of Nissan competitions to become an actual professional racecar driver.",
        "Release Year": "2023",
        "Runtime(Mins)": 135,
        "Average Vote": 7.9,
        "Popularity": 168.297,
        "Genres": "Adventure",
        "Cast": "Archie Madekwe, David Harbour, Orlando Bloom, Djimon Hounsou, Darren Barnet",
        "Director": "Neill Blomkamp"
    },
    {
        "Title": "The Machine",
        "Overview": "Bert Kreischer faces a familial crisis and the arrival of his estranged father when the ghost of his booze-soaked past arrives: a murderous mobster hellbent on kidnapping Bert back to the motherland to atone for his crimes. Together, he and his father must retrace the steps of his younger self in the midst of a war between a sociopathic crime family while they attempt to find common ground.",
        "Release Year": "2023",
        "Runtime(Mins)": 112,
        "Average Vote": 5.841,
        "Popularity": 20.352,
        "Genres": "Comedy",
        "Cast": "Bert Kreischer, Mark Hamill, Jimmy Tatro, Stephanie Kurtzuba, Nikola Đuričko",
        "Director": "Peter Atencio"
    },
    {
        "Title": "Last Call for Istanbul",
        "Overview": "A chance meeting at the airport leads two married people to an unforgettable night full of excitement, desire, and temptation in New York City.",
        "Release Year": "2023",
        "Runtime(Mins)": 91,
        "Average Vote": 6.594,
        "Popularity": 27.966,
        "Genres": "Romance",
        "Cast": "Beren Saat, Kıvanç Tatlıtuğ, Senan Kara, Zihan Zhao, Michael Loayza",
        "Director": "Gönenç Uyanık"
    },
    {
        "Title": "El Camino: A Breaking Bad Movie",
        "Overview": "In the wake of his dramatic escape from captivity, Jesse Pinkman must come to terms with his past in order to forge some kind of future.",
        "Release Year": "2019",
        "Runtime(Mins)": 123,
        "Average Vote": 6.955,
        "Popularity": 27.476,
        "Genres": "Crime",
        "Cast": "Aaron Paul, Jesse Plemons, Charles Baker, Matt Jones, Scott MacArthur",
        "Director": "Vince Gilligan"
    },
    {
        "Title": "21",
        "Overview": "Ben Campbell is a young, highly intelligent student at M.I.T. who strives to succeed. Wanting a scholarship to transfer to Harvard School of Medicine to become a doctor, Ben learns that he cannot afford the $300,000 tuition as he comes from a poor, working-class background. But one evening, Ben is introduced by his unorthodox math professor to a small but secretive club of five students, Jill, Choi, Kianna, and Fisher, who are being trained by Professor Rosa to count cards at blackjack.",
        "Release Year": "2008",
        "Runtime(Mins)": 123,
        "Average Vote": 6.699,
        "Popularity": 22.989,
        "Genres": "Drama",
        "Cast": "Jim Sturgess, Kevin Spacey, Kate Bosworth, Aaron Yoo, Liza Lapira",
        "Director": "Robert Luketic"
    },
    {
        "Title": "Guillermo del Toro's Pinocchio",
        "Overview": "During the rise of fascism in Mussolini's Italy, a wooden boy brought magically to life struggles to live up to his father's expectations.",
        "Release Year": "2022",
        "Runtime(Mins)": 117,
        "Average Vote": 8.119,
        "Popularity": 54.775,
        "Genres": "Animation",
        "Cast": "Gregory Mann, Ewan McGregor, David Bradley, Christoph Waltz, Tilda Swinton",
        "Director": "Guillermo del Toro"
    },
    {
        "Title": "Gone Girl",
        "Overview": "With his wife's disappearance having become the focus of an intense media circus, a man sees the spotlight turned on him when it's suspected that he may not be innocent.",
        "Release Year": "2014",
        "Runtime(Mins)": 149,
        "Average Vote": 7.9,
        "Popularity": 75.182,
        "Genres": "Mystery",
        "Cast": "Ben Affleck, Rosamund Pike, Neil Patrick Harris, Tyler Perry, Carrie Coon",
        "Director": "David Fincher"
    },
    {
        "Title": "The Netflix Cup",
        "Overview": "Formula 1 drivers and PGA Tour golfers team up for a star-studded sports competition at the Wynn Las Vegas golf course.",
        "Release Year": "2023",
        "Runtime(Mins)": 155,
        "Average Vote": 1.0,
        "Popularity": 1.709,
        "Genres": "",
        "Cast": "Carlos Sainz Jr., Lando Norris, Rickie Fowler, Pierre Gasly, Justin Thomas",
        "Director": "Andy Freedman"
    },
    {
        "Title": "Moneyball",
        "Overview": "The story of Oakland Athletics general manager Billy Beane's successful attempt to put together a baseball team on a budget, by employing computer-generated analysis to draft his players.",
        "Release Year": "2011",
        "Runtime(Mins)": 134,
        "Average Vote": 7.269,
        "Popularity": 25.823,
        "Genres": "Drama",
        "Cast": "Brad Pitt, Jonah Hill, Philip Seymour Hoffman, Robin Wright, Chris Pratt",
        "Director": "Bennett Miller"
    },
    {
        "Title": "The Killer",
        "Overview": "After a fateful near-miss, an assassin battles his employers, and himself, on an international manhunt he insists isn't personal.",
        "Release Year": "2023",
        "Runtime(Mins)": 118,
        "Average Vote": 6.6,
        "Popularity": 42.942,
        "Genres": "Crime",
        "Cast": "Michael Fassbender, Tilda Swinton, Charles Parnell, Arliss Howard, Kerry O'Malley",
        "Director": "David Fincher"
    },
    {
        "Title": "Annihilation",
        "Overview": "A biologist signs up for a dangerous, secret expedition into a mysterious zone where the laws of nature don't apply.",
        "Release Year": "2018",
        "Runtime(Mins)": 115,
        "Average Vote": 6.407,
        "Popularity": 62.658,
        "Genres": "Science Fiction",
        "Cast": "Natalie Portman, Jennifer Jason Leigh, Gina Rodriguez, Tessa Thompson, Tuva Novotny",
        "Director": "Alex Garland"
    },
    {
        "Title": "Wingwomen",
        "Overview": "Tired of life on the run, a pro thief decides to retire — but not before one easy last job with her partner in crime and a feisty new getaway driver.",
        "Release Year": "2023",
        "Runtime(Mins)": 114,
        "Average Vote": 6.12,
        "Popularity": 45.904,
        "Genres": "Action",
        "Cast": "Mélanie Laurent, Adèle Exarchopoulos, Isabelle Adjani, Manon Bresch, Philippe Katerine",
        "Director": "Mélanie Laurent"
    },
    {
        "Title": "13 Hours: The Secret Soldiers of Benghazi",
        "Overview": "An American Ambassador is killed during an attack at a U.S. compound in Libya as a security team struggles to make sense out of the chaos.",
        "Release Year": "2016",
        "Runtime(Mins)": 144,
        "Average Vote": 7.275,
        "Popularity": 62.597,
        "Genres": "War",
        "Cast": "John Krasinski, James Badge Dale, Dominic Fumusa, Max Martini, Pablo Schreiber",
        "Director": "Michael Bay"
    },
    {
        "Title": "You People",
        "Overview": "A new couple and their families reckon with modern love amid culture clashes, societal expectations and generational differences.",
        "Release Year": "2023",
        "Runtime(Mins)": 117,
        "Average Vote": 5.668,
        "Popularity": 20.439,
        "Genres": "Romance",
        "Cast": "Jonah Hill, Lauren London, Eddie Murphy, Julia Louis-Dreyfus, Sam Jay",
        "Director": "Kenya Barris"
    },
    {
        "Title": "Pain Hustlers",
        "Overview": "After losing her job, a single mom falls into a lucrative but ultimately dangerous scheme selling prescription drugs.",
        "Release Year": "2023",
        "Runtime(Mins)": 122,
        "Average Vote": 6.66,
        "Popularity": 27.618,
        "Genres": "Drama",
        "Cast": "Emily Blunt, Chris Evans, Catherine O'Hara, Jay Duplass, Andy García",
        "Director": "David Yates"
    },
    {
        "Title": "OMG 2",
        "Overview": "Life is bliss until one day Kanti Sharan Mudgal’s son Vivek is blamed for immoral conduct and expelled from school. Overwhelmed, Kanti plans to leave town until a divine intervention leads him to seek justice by taking those responsible to court.",
        "Release Year": "2023",
        "Runtime(Mins)": 155,
        "Average Vote": 7.194,
        "Popularity": 7.85,
        "Genres": "Comedy",
        "Cast": "Pankaj Tripathi, Akshay Kumar, Yami Gautam, Pavan Malhotra, Arun Govil",
        "Director": "Amit Rai"
    },
    {
        "Title": "Old Dads",
        "Overview": "A cranky middle-aged dad and his two best friends find themselves out of step in a changing world of millennial CEOs and powerful preschool principals.",
        "Release Year": "2023",
        "Runtime(Mins)": 102,
        "Average Vote": 6.168,
        "Popularity": 24.065,
        "Genres": "Comedy",
        "Cast": "Bill Burr, Bobby Cannavale, Bokeem Woodbine, Katie Aselton, Reign Edwards",
        "Director": "Bill Burr"
    },
    {
        "Title": "Unknown: Cosmic Time Machine",
        "Overview": "A unique behind-the-scenes access to NASA’s ambitious mission to launch the James Webb Space Telescope, following a team of engineers and scientists as they take the next giant leap in our quest to understand the universe.",
        "Release Year": "2023",
        "Runtime(Mins)": 64,
        "Average Vote": 7.541,
        "Popularity": 8.696,
        "Genres": "Documentary",
        "Cast": "Joe Biden, Amber Straughn, Thomas Zurbuchen, Becky Smethurst, Scarlin Hernandez",
        "Director": "Shai Gal"
    },
    {
        "Title": "The Dictator",
        "Overview": "The heroic story of a dictator who risks his life to ensure that democracy would never come to the country he so lovingly oppressed.",
        "Release Year": "2012",
        "Runtime(Mins)": 83,
        "Average Vote": 6.183,
        "Popularity": 32.39,
        "Genres": "Comedy",
        "Cast": "Sacha Baron Cohen, Ben Kingsley, Anna Faris, Jason Mantzoukas, Sayed Badreya",
        "Director": "Larry Charles"
    },
    {
        "Title": "Reptile",
        "Overview": "Following the brutal murder of a young real estate agent, a hardened detective attempts to uncover the truth in a case where nothing is as it seems, and by doing so dismantles the illusions in his own life.",
        "Release Year": "2023",
        "Runtime(Mins)": 136,
        "Average Vote": 6.754,
        "Popularity": 30.939,
        "Genres": "Crime",
        "Cast": "Benicio del Toro, Justin Timberlake, Alicia Silverstone, Michael Pitt, Karl Glusman",
        "Director": "Grant Singer"
    },
    {
        "Title": "Uncut Gems",
        "Overview": "A charismatic New York City jeweler always on the lookout for the next big score makes a series of high-stakes bets that could lead to the windfall of a lifetime. Howard must perform a precarious high-wire act, balancing business, family, and encroaching adversaries on all sides in his relentless pursuit of the ultimate win.",
        "Release Year": "2019",
        "Runtime(Mins)": 136,
        "Average Vote": 7.146,
        "Popularity": 28.183,
        "Genres": "Drama",
        "Cast": "Adam Sandler, LaKeith Stanfield, Julia Fox, Kevin Garnett, Idina Menzel",
        "Director": "Josh Safdie"
    },
    {
        "Title": "They Cloned Tyrone",
        "Overview": "A series of eerie events thrusts an unlikely trio onto the trail of a nefarious government conspiracy lurking directly beneath their neighborhood.",
        "Release Year": "2023",
        "Runtime(Mins)": 122,
        "Average Vote": 6.626,
        "Popularity": 17.056,
        "Genres": "Comedy",
        "Cast": "John Boyega, Teyonah Parris, Jamie Foxx, Kiefer Sutherland, David Alan Grier",
        "Director": "Juel Taylor"
    },
    {
        "Title": "War Machine",
        "Overview": "A rock star general bent on winning the “impossible” war in Afghanistan takes us inside the complex machinery of modern war. Inspired by the true story of General Stanley McChrystal.",
        "Release Year": "2017",
        "Runtime(Mins)": 122,
        "Average Vote": 5.589,
        "Popularity": 13.218,
        "Genres": "Comedy",
        "Cast": "Brad Pitt, Anthony Michael Hall, Emory Cohen, John Magaro, Topher Grace",
        "Director": "David Michôd"
    },
    {
        "Title": "Jack Reacher: Never Go Back",
        "Overview": "When Major Susan Turner is arrested for treason, ex-investigator Jack Reacher undertakes the challenging task to prove her innocence and ends up exposing a shocking conspiracy.",
        "Release Year": "2016",
        "Runtime(Mins)": 118,
        "Average Vote": 5.971,
        "Popularity": 51.614,
        "Genres": "Action",
        "Cast": "Tom Cruise, Cobie Smulders, Danika Yarosh, Aldis Hodge, Patrick Heusinger",
        "Director": "Edward Zwick"
    },
    {
        "Title": "Wifelike",
        "Overview": "A grieving detective in the near-future hunts down criminals who trade artificial humans on the black market. In the fight to end AI exploitation, an underground resistance attempts to infiltrate him by sabotaging the programming of the artificial human assigned as his companion to behave like his late wife. She begins to question her reality as memories of a past life begin to surface in a world where nothing is as it seems.",
        "Release Year": "2022",
        "Runtime(Mins)": 106,
        "Average Vote": 6.9,
        "Popularity": 87.754,
        "Genres": "Science Fiction",
        "Cast": "Elena Kampouris, Jonathan Rhys Meyers, Doron Bell, Agam Darshi, Sara Sampaio",
        "Director": "James Bird"
    },
    {
        "Title": "Running with the Devil: The Wild World of John McAfee",
        "Overview": "Through raw, revealing footage and interviews with fugitive tech pioneer John McAfee, this documentary uncovers new layers of his wild years on the run.",
        "Release Year": "2022",
        "Runtime(Mins)": 105,
        "Average Vote": 6.356,
        "Popularity": 6.902,
        "Genres": "Documentary",
        "Cast": "John McAfee",
        "Director": "Charlie Russell"
    },
    {
        "Title": "Transformers: The Last Knight",
        "Overview": "Autobots and Decepticons are at war, with humans on the sidelines. Optimus Prime is gone. The key to saving our future lies buried in the secrets of the past, in the hidden history of Transformers on Earth.",
        "Release Year": "2017",
        "Runtime(Mins)": 154,
        "Average Vote": 6.1,
        "Popularity": 64.044,
        "Genres": "Action",
        "Cast": "Mark Wahlberg, Josh Duhamel, Stanley Tucci, Anthony Hopkins, Isabela Merced",
        "Director": "Michael Bay"
    },
    {
        "Title": "Black Mirror: Bandersnatch",
        "Overview": "In 1984, a young programmer begins to question reality as he adapts a dark fantasy novel into a video game. A mind-bending tale with multiple endings.",
        "Release Year": "2018",
        "Runtime(Mins)": 90,
        "Average Vote": 6.767,
        "Popularity": 17.695,
        "Genres": "Science Fiction",
        "Cast": "Fionn Whitehead, Craig Parkinson, Alice Lowe, Asim Chaudhry, Will Poulter",
        "Director": "David Slade"
    },
    {
        "Title": "Ad Astra",
        "Overview": "The near future, a time when both hope and hardships drive humanity to look to the stars and beyond. While a mysterious phenomenon menaces to destroy life on planet Earth, astronaut Roy McBride undertakes a mission across the immensity of space and its many perils to uncover the truth about a lost expedition that decades before boldly faced emptiness and silence in search of the unknown.",
        "Release Year": "2019",
        "Runtime(Mins)": 123,
        "Average Vote": 6.101,
        "Popularity": 19.915,
        "Genres": "Science Fiction",
        "Cast": "Brad Pitt, Tommy Lee Jones, Ruth Negga, John Ortiz, Liv Tyler",
        "Director": "James Gray"
    },
    {
        "Title": "Ex Machina",
        "Overview": "Caleb, a coder at the world's largest internet company, wins a competition to spend a week at a private mountain retreat belonging to Nathan, the reclusive CEO of the company. But when Caleb arrives at the remote location he finds that he will have to participate in a strange and fascinating experiment in which he must interact with the world's first true artificial intelligence, housed in the body of a beautiful robot girl.",
        "Release Year": "2015",
        "Runtime(Mins)": 108,
        "Average Vote": 7.573,
        "Popularity": 42.885,
        "Genres": "Drama",
        "Cast": "Domhnall Gleeson, Alicia Vikander, Oscar Isaac, Sonoya Mizuno, Corey Johnson",
        "Director": "Alex Garland"
    },
    {
        "Title": "Stowaway",
        "Overview": "A tenacious party girl fights to survive after three thieves commandeer her luxury yacht. Unable to escape and trapped on the yacht at high seas, the prey becomes the hunter as she turns the tables on the intruders and takes matters into her own hands.",
        "Release Year": "2022",
        "Runtime(Mins)": 94,
        "Average Vote": 6.543,
        "Popularity": 17.547,
        "Genres": "Action",
        "Cast": "Ruby Rose, Patrick Schwarzenegger, Frank Grillo, Danny Bohnen, Scotty Bohnen",
        "Director": "Declan Whitebloom"
    },
    {
        "Title": "Extraction 2",
        "Overview": "Tasked with extracting a family who is at the mercy of a Georgian gangster, Tyler Rake infiltrates one of the world's deadliest prisons in order to save them. But when the extraction gets hot, and the gangster dies in the heat of battle, his equally ruthless brother tracks down Rake and his team to Vienna, in order to get revenge.",
        "Release Year": "2023",
        "Runtime(Mins)": 122,
        "Average Vote": 7.462,
        "Popularity": 98.553,
        "Genres": "Action",
        "Cast": "Chris Hemsworth, Golshifteh Farahani, Adam Bessa, Tornike Gogrichiani, Tornike Bziava",
        "Director": "Sam Hargrave"
    },
    {
        "Title": "Ánima",
        "Overview": "Samuel is surprised by a subject identical to him and begins to discover that the world around him is controlled by someone superior.",
        "Release Year": "2023",
        "Runtime(Mins)": 89,
        "Average Vote": 6.75,
        "Popularity": 8.319,
        "Genres": "Science Fiction",
        "Cast": "Marcos Duarte, Isaac Perez Calzada, Blanca Ferreyra, Danae Luna, Jenny Stillman",
        "Director": "Alejandro G. Alegre"
    },
    {
        "Title": "Spider-Man: Into the Spider-Verse",
        "Overview": "Struggling to find his place in the world while juggling school and family, Brooklyn teenager Miles Morales is unexpectedly bitten by a radioactive spider and develops unfathomable powers just like the one and only Spider-Man. While wrestling with the implications of his new abilities, Miles discovers a super collider created by the madman Wilson \"Kingpin\" Fisk, causing others from across the Spider-Verse to be inadvertently transported to his dimension.",
        "Release Year": "2018",
        "Runtime(Mins)": 117,
        "Average Vote": 8.406,
        "Popularity": 85.441,
        "Genres": "Action",
        "Cast": "Shameik Moore, Jake Johnson, Hailee Steinfeld, Mahershala Ali, Brian Tyree Henry",
        "Director": "Rodney Rothman"
    },
    {
        "Title": "Kate",
        "Overview": "A ruthless criminal operative has less than 24 hours to exact revenge on her enemies and in the process forms an unexpected bond with the daughter of one of her past victims.",
        "Release Year": "2021",
        "Runtime(Mins)": 106,
        "Average Vote": 6.653,
        "Popularity": 15.101,
        "Genres": "Action",
        "Cast": "Mary Elizabeth Winstead, Miku Martineau, Woody Harrelson, Tadanobu Asano, Jun Kunimura",
        "Director": "Cedric Nicolas-Troyan"
    },
    {
        "Title": "The Bubble",
        "Overview": "Sneaking out. Hooking up. Melting down. The cast and crew of a blockbuster action franchise attempt to shoot a sequel while quarantining at a posh hotel.",
        "Release Year": "2022",
        "Runtime(Mins)": 127,
        "Average Vote": 4.659,
        "Popularity": 15.467,
        "Genres": "Comedy",
        "Cast": "Karen Gillan, Iris Apatow, Fred Armisen, Maria Bakalova, Vir Das",
        "Director": "Judd Apatow"
    },
    {
        "Title": "Snowden",
        "Overview": "CIA employee Edward Snowden leaks thousands of classified documents to the press.",
        "Release Year": "2016",
        "Runtime(Mins)": 134,
        "Average Vote": 7.101,
        "Popularity": 29.595,
        "Genres": "Drama",
        "Cast": "Joseph Gordon-Levitt, Shailene Woodley, Melissa Leo, Zachary Quinto, Tom Wilkinson",
        "Director": "Oliver Stone"
    },
    {
        "Title": "Downfall: The Case Against Boeing",
        "Overview": "Investigators reveal how Boeing’s alleged priority of profit over safety could have contributed to two catastrophic crashes within months of each other.",
        "Release Year": "2022",
        "Runtime(Mins)": 89,
        "Average Vote": 7.1,
        "Popularity": 11.966,
        "Genres": "Documentary",
        "Cast": "John Fantasia, Elaine Chao",
        "Director": "Rory Kennedy"
    },
    {
        "Title": "Enola Holmes 2",
        "Overview": "Now a detective-for-hire like her infamous brother, Enola Holmes takes on her first official case to find a missing girl, as the sparks of a dangerous conspiracy ignite a mystery that requires the help of friends — and Sherlock himself — to unravel.",
        "Release Year": "2022",
        "Runtime(Mins)": 129,
        "Average Vote": 7.4,
        "Popularity": 39.622,
        "Genres": "Adventure",
        "Cast": "Millie Bobby Brown, Henry Cavill, David Thewlis, Louis Partridge, Susan Wokoma",
        "Director": "Harry Bradbeer"
    },
    {
        "Title": "The Social Network",
        "Overview": "In 2003, Harvard undergrad and computer genius Mark Zuckerberg begins work on a new concept that eventually turns into the global social network known as Facebook. Six years later, he is one of the youngest billionaires ever, but Zuckerberg finds that his unprecedented success leads to both personal and legal complications when he ends up on the receiving end of two lawsuits, one involving his former friend.",
        "Release Year": "2010",
        "Runtime(Mins)": 121,
        "Average Vote": 7.4,
        "Popularity": 41.3,
        "Genres": "Drama",
        "Cast": "Jesse Eisenberg, Andrew Garfield, Armie Hammer, Justin Timberlake, Max Minghella",
        "Director": "David Fincher"
    },
    {
        "Title": "Slumberland",
        "Overview": "A young girl discovers a secret map to the dreamworld of Slumberland, and with the help of an eccentric outlaw, she traverses dreams and flees nightmares, with the hope that she will be able to see her late father again.",
        "Release Year": "2022",
        "Runtime(Mins)": 117,
        "Average Vote": 7.396,
        "Popularity": 19.748,
        "Genres": "Family",
        "Cast": "Marlow Barkley, Jason Momoa, Chris O'Dowd, Kyle Chandler, Weruche Opia",
        "Director": "Francis Lawrence"
    },
    {
        "Title": "Interstellar",
        "Overview": "The adventures of a group of explorers who make use of a newly discovered wormhole to surpass the limitations on human space travel and conquer the vast distances involved in an interstellar voyage.",
        "Release Year": "2014",
        "Runtime(Mins)": 169,
        "Average Vote": 8.4,
        "Popularity": 167.648,
        "Genres": "Adventure",
        "Cast": "Matthew McConaughey, Anne Hathaway, Jessica Chastain, Michael Caine, Bill Irwin",
        "Director": "Christopher Nolan"
    },
    {
        "Title": "The Swimmers",
        "Overview": "From war-torn Syria to the 2016 Rio Olympics, two young sisters embark on a risky voyage, putting their hearts and their swimming skills to heroic use.",
        "Release Year": "2022",
        "Runtime(Mins)": 134,
        "Average Vote": 7.452,
        "Popularity": 15.883,
        "Genres": "Drama",
        "Cast": "Manal Issa, Nathalie Issa, Matthias Schweighöfer, Ali Suliman, James Floyd",
        "Director": "Sally El Hosaini"
    },
    {
        "Title": "Uncharted",
        "Overview": "A young street-smart, Nathan Drake and his wisecracking partner Victor “Sully” Sullivan embark on a dangerous pursuit of “the greatest treasure never found” while also tracking clues that may lead to Nathan’s long-lost brother.",
        "Release Year": "2022",
        "Runtime(Mins)": 116,
        "Average Vote": 7.0,
        "Popularity": 110.054,
        "Genres": "Action",
        "Cast": "Tom Holland, Mark Wahlberg, Sophia Ali, Tati Gabrielle, Antonio Banderas",
        "Director": "Ruben Fleischer"
    },
    {
        "Title": "A Farewell to Ozark",
        "Overview": "Jason Bateman, Laura Linney and other cast members open up about the show's characters and creators, plus what they'll miss most.",
        "Release Year": "2022",
        "Runtime(Mins)": 31,
        "Average Vote": 6.4,
        "Popularity": 6.569,
        "Genres": "Documentary",
        "Cast": "Jason Bateman, Laura Linney, Julia Garner, Sofia Hublitz, Skylar Gaertner",
        "Director": "N/A"
    },
    {
        "Title": "Jonas Brothers Family Roast",
        "Overview": "A comedy roast of the pop band Jonas Brothers includes sketches, songs, games, and special guests.",
        "Release Year": "2021",
        "Runtime(Mins)": 68,
        "Average Vote": 6.732,
        "Popularity": 6.432,
        "Genres": "Comedy",
        "Cast": "Nick Jonas, Joe Jonas, Kevin Jonas, Danielle Jonas, Priyanka Chopra Jonas",
        "Director": "Alex Van Wagner"
    },
    {
        "Title": "Bill Burr: Live at Red Rocks",
        "Overview": "Comedian Bill Burr sounds off on cancel culture, feminism, getting bad reviews from his wife and a life-changing epiphany during a fiery stand-up set.",
        "Release Year": "2022",
        "Runtime(Mins)": 82,
        "Average Vote": 7.148,
        "Popularity": 7.49,
        "Genres": "Comedy",
        "Cast": "Bill Burr",
        "Director": "Mike Binder"
    },
    {
        "Title": "Aziz Ansari: Live at Madison Square Garden",
        "Overview": "Ansari headlines the iconic Madison Square Garden and delivers his most hilarious and insightful stand-up yet. Filmed in front of a sold-out audience, Ansari's latest special is an uproarious document of the comic in top form -- covering topics ranging from the struggle of American immigrants to the food industry to relationships to gender inequality.",
        "Release Year": "2015",
        "Runtime(Mins)": 58,
        "Average Vote": 6.6,
        "Popularity": 5.291,
        "Genres": "Comedy",
        "Cast": "Aziz Ansari",
        "Director": "Aziz Ansari"
    },
    {
        "Title": "Pete Davidson Presents: The Best Friends",
        "Overview": "Pete Davidson jokes about rumors, free plane rides and his very weird year as he invites his friends onstage for a night of stand-up comedy and music.",
        "Release Year": "2022",
        "Runtime(Mins)": 58,
        "Average Vote": 5.1,
        "Popularity": 2.741,
        "Genres": "Comedy",
        "Cast": "Pete Davidson, Machine Gun Kelly, Neko White, Giulio Gallarotti, Carly Aquilino",
        "Director": "Jason Orley"
    },
    {
        "Title": "Gabriel Iglesias: Stadium Fluffy",
        "Overview": "Gabriel “Fluffy” Iglesias makes history as the first comedian to perform at Dodger Stadium in his new special Stadium Fluffy: Live From Los Angeles. Filmed at Netflix Is a Joke: The Festival, Gabriel hilariously shares details about being a Los Angeles native, a recent attempt at extortion towards him, and where he holds the record for receiving the highest fine on stage.",
        "Release Year": "2022",
        "Runtime(Mins)": 115,
        "Average Vote": 7.19,
        "Popularity": 4.347,
        "Genres": "Comedy",
        "Cast": "Gabriel Iglesias",
        "Director": "Manny Rodriguez"
    },
    {
        "Title": "Pete Davidson: Alive from New York",
        "Overview": "Comedian and \"SNL\" star Pete Davidson drops a candid and intimate stand-up special shot live in New York City.",
        "Release Year": "2020",
        "Runtime(Mins)": 49,
        "Average Vote": 6.1,
        "Popularity": 5.128,
        "Genres": "Comedy",
        "Cast": "Pete Davidson",
        "Director": "Jason Orley"
    },
    {
        "Title": "Ricky Gervais: SuperNature",
        "Overview": "With his signature pitch-black sense of humor, Ricky Gervais takes the stage at the London Palladium in this provocative stand-up comedy special.",
        "Release Year": "2022",
        "Runtime(Mins)": 64,
        "Average Vote": 7.407,
        "Popularity": 9.046,
        "Genres": "Comedy",
        "Cast": "Ricky Gervais",
        "Director": "John L. Spencer"
    },
    {
        "Title": "Hasan Minhaj: The King's Jester",
        "Overview": "Filmed at the historic Brooklyn Academy of Music, Hasan Minhaj returns to Netflix with his second stand-up comedy special Hasan Minhaj: The King's Jester. In this hilarious performance, Hasan shares his thoughts on fertility, fatherhood, and freedom of speech.",
        "Release Year": "2022",
        "Runtime(Mins)": 60,
        "Average Vote": 7.1,
        "Popularity": 4.691,
        "Genres": "Comedy",
        "Cast": "Hasan Minhaj",
        "Director": "Prashanth Venkataramanujam"
    },
    {
        "Title": "All Quiet on the Western Front",
        "Overview": "Paul Baumer and his friends Albert and Muller, egged on by romantic dreams of heroism, voluntarily enlist in the German army. Full of excitement and patriotic fervour, the boys enthusiastically march into a war they believe in. But once on the Western Front, they discover the soul-destroying horror of World War I.",
        "Release Year": "2022",
        "Runtime(Mins)": 147,
        "Average Vote": 7.734,
        "Popularity": 72.626,
        "Genres": "Drama",
        "Cast": "Felix Kammerer, Albrecht Schuch, Aaron Hilmer, Moritz Klaus, Adrian Grünewald",
        "Director": "Edward Berger"
    },
    {
        "Title": "In Time",
        "Overview": "In the not-too-distant future, the aging gene has been switched off. To avoid overpopulation, time has become the currency and the way people pay for luxuries and necessities. The rich can live forever, while the rest try to negotiate for their immortality. A poor young man who comes into a fortune of time is too late to help his mother from dying. He ends up on the run from a corrupt police force known as the \"time keepers\".",
        "Release Year": "2011",
        "Runtime(Mins)": 109,
        "Average Vote": 7.0,
        "Popularity": 91.16,
        "Genres": "Action",
        "Cast": "Justin Timberlake, Amanda Seyfried, Cillian Murphy, Olivia Wilde, Alex Pettyfer",
        "Director": "Andrew Niccol"
    },
    {
        "Title": "Army of Thieves",
        "Overview": "A mysterious woman recruits bank teller Ludwig Dieter to lead a group of aspiring thieves on a top-secret heist during the early stages of the zombie apocalypse.",
        "Release Year": "2021",
        "Runtime(Mins)": 127,
        "Average Vote": 6.853,
        "Popularity": 39.58,
        "Genres": "Action",
        "Cast": "Matthias Schweighöfer, Nathalie Emmanuel, Ruby O. Fee, Stuart Martin, Guz Khan",
        "Director": "Matthias Schweighöfer"
    },
    {
        "Title": "The Adam Project",
        "Overview": "After accidentally crash-landing in 2022, time-traveling fighter pilot Adam Reed teams up with his 12-year-old self on a mission to save the future.",
        "Release Year": "2022",
        "Runtime(Mins)": 106,
        "Average Vote": 7.045,
        "Popularity": 51.996,
        "Genres": "Adventure",
        "Cast": "Ryan Reynolds, Walker Scobell, Mark Ruffalo, Jennifer Garner, Zoe Saldaña",
        "Director": "Shawn Levy"
    }
]